Repository: markocupic/contao-bundle-creator-bundle
Catalog: src/Resources/contao/languages/*/*_contao_bundle_creator.xlf
Languages: de

# tl_contao_bundle_creator.edit.0
source: Edit ID %s
de: Bundle ID %s bearbeiten

# tl_contao_bundle_creator.edit.1
source: Edit bundle ID %s
de: Bundle ID %s bearbeiten

# tl_contao_bundle_creator.copy.0
source: Duplicate bundle ID %s
de: Bundle ID %s duplizieren

# tl_contao_bundle_creator.copy.1
source: Duplicate bundle ID %s
de: Bundle ID %s duplizieren

# tl_contao_bundle_creator.delete.0
source: Delete bundle ID %s
de: Bundle ID %s löschen

# tl_contao_bundle_creator.delete.1
source: Delete bundle ID %s
de: Bundle ID %s löschen

# tl_contao_bundle_creator.show.0
source: Watch details bundle ID %s
de: Bundle ID %s ansehen

# tl_contao_bundle_creator.show.1
source: Watch details bundle ID %s
de: Details des Bundles ID %s anzeigen

# tl_contao_bundle_creator.bundle_settings_legend
source: Bundle settings
de: Bundle Einstellungen

# tl_contao_bundle_creator.composer_settings_legend
source: composer.json settings
de: composer.json Einstellungen

# tl_contao_bundle_creator.rootcomposer_settings_legend
source: (ROOT-)composer.json settings
de: (ROOT-)composer.json Einstellungen

# tl_contao_bundle_creator.dcatable_settings_legend
source: DCA table settings
de: DCA Tabellen Einstellungen

# tl_contao_bundle_creator.frontendmodule_settings_legend
source: Frontend moule settings
de: Frontendmodul Einstellungen

# tl_contao_bundle_creator.custom_route_settings_legend
source: Custom route settings
de: Custom Route Einstellungen

# tl_contao_bundle_creator.bundlename.1
source: Please enter a name for the bundle.
de: Geben Sie einen Namen für das Bundle ein.

# tl_contao_bundle_creator.vendorname.1
source: Please enter a vendor name.
de: Geben Sie Ihren Vendornamen ein.

# tl_contao_bundle_creator.repositoryname.0
source: (Github-) repository name (use "contao-" as prefix and "-bundle" as suffix)
de: (Github-) Repository Name (mit "contao-" als Prefix und "-bundle" als Suffix)

# tl_contao_bundle_creator.repositoryname.1
source: Please enter the repository name.
de: Geben Sie den Repository Namen für das Bundle ein.

# tl_contao_bundle_creator.overwriteexisting.0
source: Override bundle of the same name
de: Gleichnamiges Bundle überschreiben

# tl_contao_bundle_creator.overwriteexisting.1
source: Should the bundle of the same name be overwritten?
de: Soll ein gleichnamiges, bereits bestehendes Bundle überschrieben werden?

# tl_contao_bundle_creator.composerdescription.0
source: composer.json: description text
de: composer.json: Beschreibungstext

# tl_contao_bundle_creator.composerdescription.1
source: Please enter the text for the description section in the composer.json file of your new bundle.
de: Geben Sie den Beschreibungstext für die composer.json ein.

# tl_contao_bundle_creator.composerpackageversion.0
source: composer.json: package version (Mandatory for package uploads with the Contao Manager)
de: composer.json: Paketversion (Nötig für Paketupload mit Contao Manager)

# tl_contao_bundle_creator.composerpackageversion.1
source: Please enter the package version in format 1.x (Mandatory only for package uploads with the Contao Manager).
de: Geben Sie die Paketversion im Format 1.x ein. (Nur nötig, wenn das Bundle über Paketupload in Contao Manager bereitgestellt wird).

# tl_contao_bundle_creator.editRootComposer.0
source: Edit composer.json (ROOT)
de: Composer.json (ROOT) bearbeiten

# tl_contao_bundle_creator.editRootComposer.1
source: Authorize the bundle generator editing your composer.json (ROOT)?
de: Den Bundle Generator autorisieren die composer.json (ROOT) anzupassen?

# tl_contao_bundle_creator.rootcomposerextendrepositorieskey.0
source: composer.json (ROOT): Extend the file with an entry at the key: "repositories"?
de: Composer.json (ROOT) mit einem Eintrag im Key: "repositories" erweitern?

# tl_contao_bundle_creator.rootcomposerextendrepositorieskey.1
source: Should your (ROOT-) composer.json be extended with an entry at the key: "repositories"?
de: (ROOT-) composer.json mit einem Eintrag im Key: "repositories" erweitern?

# tl_contao_bundle_creator.composerlicense.0
source: composer.json: license
de: composer.json: Lizenz

# tl_contao_bundle_creator.composerlicense.1
source: Please enter the license type. e.g. MIT.
de: Geben Sie die Lizenz an. z.B. MIT.

# tl_contao_bundle_creator.composerauthorname.0
source: composer.json: author name
de: composer.json: Name des Autors

# tl_contao_bundle_creator.composerauthorname.1
source: Please enter the author's name.
de: Geben Sie den Namen des Entwicklers ein.

# tl_contao_bundle_creator.composerauthoremail.0
source: composer.json: author email address
de: composer.json: E-Mail-Adresse des Autors

# tl_contao_bundle_creator.composerauthoremail.1
source: Please enter the authors's email address.
de: Geben Sie die E-Mail-Adresse des Autors an.

# tl_contao_bundle_creator.composerauthorwebsite.0
source: composer.json: website
de: composer.json: Webseite

# tl_contao_bundle_creator.composerauthorwebsite.1
source: Please enter the author's website. e.g. https://github.com/vendorname
de: Bitte geben Sie die Webseite des Autors ein. Z.B https://github.com/vendorname

# tl_contao_bundle_creator.addBackendModule.0
source: Add a backend module with a dca table
de: Backendmodul mit dca-Tabelle hinzufügen

# tl_contao_bundle_creator.addBackendModule.1
source: Should a backend module with a dca table be added?
de: Fügt dem Bundle ein Backendmodul inkl. dca-Tabelle hinzu.

# tl_contao_bundle_creator.backendmodulecategory.0
source: Backend module category
de: Backendmodul-Kategorie

# tl_contao_bundle_creator.backendmodulecategory.1
source: Please enter the backend module category as a snakecased string.
de: Geben Sie die Backenmodul-Kategorie in snakecase an.

# tl_contao_bundle_creator.backendmodulecategorytrans.0
source: Backend module category translation
de: Backendmodul-Kategorie-Übersetzung

# tl_contao_bundle_creator.backendmodulecategorytrans.1
source: Let the field empty if the category and the translation already exists.
de: Falls die Kategorie bereits besteht, kann das Feld leer gelassen werden.

# tl_contao_bundle_creator.backendmoduletype.0
source: Backendmodule type
de: Backendmodul-Typ

# tl_contao_bundle_creator.backendmoduletype.1
source: Please enter the backend module type as a snakecased string.
de: Geben Sie den Typ des Backendmoduls in snakecase an.

# tl_contao_bundle_creator.backendmoduletrans.0
source: Backend module type translation and description
de: Backendmodul-Typ-Übersetzung und Beschreibung

# tl_contao_bundle_creator.backendmoduletrans.1
source: Please add a name and a description for the backend module.
de: Geben Sie dem Modul einen Namen und eine Beschreibung.

# tl_contao_bundle_creator.dcatable.0
source: DCA table name
de: DCA Tabellenname

# tl_contao_bundle_creator.dcatable.1
source: Please enter a name for the table: e.g. tl_my_pets
de: Geben Sie den Namen der Tabelle an: z.B. tl_my_pets

# tl_contao_bundle_creator.frontendmodulecategory.0
source: Frontend module category (snakecase)
de: Frontendmodul-Kategorie (snakecase)

# tl_contao_bundle_creator.frontendmodulecategory.1
source: Please enter the frontend module category as a snakecased string.
de: Geben Sie die Frontendmodul-Kategorie in snakecase an.

# tl_contao_bundle_creator.frontendmodulecategorytrans.0
source: Frontend module category translation
de: Frontendmodul-Kategorie-Übersetzung

# tl_contao_bundle_creator.frontendmodulecategorytrans.1
source: Let the field empty if the category and the translation already exists.
de: Falls die Kategorie bereits besteht, kann das Feld leer gelassen werden.

# tl_contao_bundle_creator.frontendmoduletype.0
source: Frontend module type (snakecase with "_module" as a suffix)
de: Frontendmodul-Typ (snakecase mit "_module" als suffix)

# tl_contao_bundle_creator.frontendmoduletype.1
source: Please enter the frontend module type as a snakecased string.
de: Geben Sie den Typ des Frontendmoduls in snakecase an.

# tl_contao_bundle_creator.frontendmoduletrans.0
source: Frontend module type name and description
de: Frontendmodul-Typ-Übersetzung und Beschreibung

# tl_contao_bundle_creator.frontendmoduletrans.1
source: Please add a name and a description for the frontend module.
de: Geben Sie dem Modul einen Namen und eine Beschreibung.

# tl_contao_bundle_creator.addCustomRoute.0
source: Add a custom route
de: Benutzerdefinierte Route hinzufügen

# tl_contao_bundle_creator.addCustomRoute.1
source: Should a custom route be added to the bundle?
de: Eine benutzerdefinierte Route hinzufügen?

# tl_contao_bundle_creator.createBundleButton
source: Generate bundle
de: Bundle-Generator starten

# tl_contao_bundle_creator.downloadBundleButton
source: Download bundle
de: Bundle herunterladen
